[
  {
    "title": "Application FWD Insurance React Native",
    "description": "Plateforme d'assurance entreprise avec modules DMS, OWB et UnderWrite Me pour des opérations simplifiées et une expérience utilisateur améliorée.",
    "fullDescription": "Une plateforme d'assurance complète construite avec React Native, fournissant aux agents des outils numériques pour gérer les politiques clients, la souscription et le traitement des sinistres. Les caractéristiques incluent la synchronisation en temps réel, les capacités hors ligne et la compatibilité multiplateforme.",
    "image": "/image/Project1.png",
    "techStack": ["React Native", "RESTful APIs", "Redux", "TypeScript"],
    "metrics": "Amélioration de l'efficacité de 15%",
    "liveUrl": "https://www.fwd.com/en/the-fwd-difference/doing-more-with-digital-technology/giving-our-agents-the-digital-tools-they-need/",
    "highlights": [
      "Intégration DMS",
      "Fonctionnalité en ligne/hors ligne",
      "Synchronisation des données en temps réel",
      "Support multiplateforme"
    ]
  },
  {
    "title": "Plateforme Maybank de Banque Numérique",
    "description": "Application moderne d'une seule page pour les services de banque numérique avec des performances optimisées et une expérience utilisateur transparente.",
    "fullDescription": "Une plateforme de banque numérique riche en fonctionnalités qui permet aux clients de gérer leurs finances, transférer des fonds, payer des factures et demander des produits bancaires. Construite avec React et optimisée pour les temps de chargement rapides et le design réactif.",
    "image": "/image/Project2.png",
    "techStack": ["React.js", "Redux", "React Hooks", "Axios"],
    "metrics": "Vitesse de chargement 15% plus rapide",
    "liveUrl": "https://www.maybank2u.com.my/home/m2u/common/login.do",
    "highlights": [
      "Temps de chargement rapides",
      "Design réactif",
      "Authentification sécurisée",
      "Multiples fonctionnalités bancaires"
    ]
  },
  {
    "title": "Intégration API Bancaire",
    "description": "Développement d'API RESTful pour l'intégration de produits d'assurance, permettant des renouvellements et achats transparents via les partenaires bancaires.",
    "fullDescription": "Une couche API robuste qui permet l'intégration de produits d'assurance au sein des plates-formes bancaires. Prend en charge les renouvellements de polices, les nouveaux achats, la soumission de sinistres et les intégrations de service clientèle sur plusieurs partenaires bancaires.",
    "image": "/image/Project3.png",
    "techStack": ["Spring Boot", "RESTful APIs", "Microservices", "Java"],
    "highlights": [
      "Architecture de microservices",
      "Conception orientée API",
      "Haute disponibilité",
      "Intégration des partenaires bancaires"
    ],
    "githubUrl": "#"
  },
  {
    "title": "Tableau de Bord Analytique Power BI",
    "description": "Solution complète de visualisation des données fournissant des informations commerciales exploitables et des analyses en temps réel pour la prise de décision.",
    "fullDescription": "Un tableau de bord analytique avancé qui consolide les données de plusieurs sources, fournissant des informations en temps réel sur les métriques commerciales, les tendances des clients et les performances opérationnelles. Comprend des visualisations interactives et le suivi personnalisé des KPI.",
    "image": "/image/Project4.png",
    "techStack": ["Power BI", "Data Visualization", "SQL", "DAX"],
    "highlights": [
      "Analyses en temps réel",
      "KPI personnalisés",
      "Consolidation des données",
      "Tableaux de bord interactifs"
    ],
    "liveUrl": "#"
  },
  {
    "title": "Portail d'Équipe Transfrontalier",
    "description": "Plateforme de gestion de projet et de collaboration pour les équipes distribuées avec les mises à jour en temps réel et le suivi des performances.",
    "fullDescription": "Une plateforme de collaboration complète conçue pour les équipes distribuées dans plusieurs pays. Comprend la gestion de projet, la communication en temps réel, le partage de fichiers et l'analyse des performances pour la collaboration des équipes distribuées.",
    "image": "/image/Project5.png",
    "techStack": ["React", "Node.js", "MongoDB", "WebSocket"],
    "highlights": [
      "Collaboration en temps réel",
      "Gestion de projet",
      "Analyse d'équipe",
      "Partage de fichiers"
    ],
    "liveUrl": "#"
  },
  {
    "title": "Outil de Conformité Cybersécurité",
    "description": "Système d'évaluation des vulnérabilités de sécurité et de surveillance de la conformité aux normes Bank Negara.",
    "fullDescription": "Un outil de surveillance de la sécurité et de conformité de niveau entreprise qui identifie les vulnérabilités, suit la conformité aux réglementations bancaires et fournit des recommandations de correction automatisées. Garantit le respect des normes de sécurité de Bank Negara Malaysia.",
    "image": "/image/Project6.png",
    "techStack": ["Java", "Spring Security", "PostgreSQL", "Docker"],
    "highlights": [
      "Analyse des vulnérabilités",
      "Surveillance de la conformité",
      "Automatisation de la sécurité",
      "Respect réglementaire"
    ],
    "githubUrl": "#"
  }
]
