[
  {
    "title": "FWD காப்பீடு React Native பயன்பாடு",
    "description": "DMS, OWB மற்றும் UnderWrite Me தொகுதிகளுடன் நிறுவன காப்பீட்டு தளம் மென்மையான செயல்பாடுகள் மற்றும் மேம்பட்ட பயனர் அனுபவத்திற்கு।",
    "fullDescription": "React Native உடன் கட்டப்பட்ட ஒரு விரிவான காப்பீட்டு தளம், முகவர்களுக்கு গ்রிடாக கொள்கைகள், குறியாக்கம் மற்றும் கோரை செயல்பாட்டை நிர்வகிப்பதற்கான ডிஜிட்டல் கருவிகளை வழங்குகிறது। அம்சங்களில் நிரந்தர நிலை ஒத்திசைவு, ஆஃப்லைன் திறன்கள் மற்றும் குறுக்கு-தளம் பொருத்தக்கூடிய பயன்பாடுகள் உள்ளன।",
    "image": "/image/Project1.png",
    "techStack": ["React Native", "RESTful APIs", "Redux", "TypeScript"],
    "metrics": "15% செயல்திறன் மேம்பாடு",
    "liveUrl": "https://www.fwd.com/en/the-fwd-difference/doing-more-with-digital-technology/giving-our-agents-the-digital-tools-they-need/",
    "highlights": [
      "DMS ஒருங்கிணைப்பு",
      "ஆன்லைன்/ஆஃப்லைன் செயல்பாடு",
      "நிரந்தர நிலை தரவு ஒத்திசைவு",
      "பல-தளம் ஆதரவு"
    ]
  },
  {
    "title": "Maybank டிஜிட்டல் வங்கி தளம்",
    "description": "டிஜிட்டல் வங்கி சேவைகளுக்கான நவீன ஒற்றை-பக்கை பயன்பாடு உன்னதிகர செயல்திறன் மற்றும் சீரமைந்த பயனர் அனுபவம் கொண்டு।",
    "fullDescription": "ஒரு பண்புடைய டிஜிட்டல் வங்கி தளம் இதுக்கு வாடிக்கையாளர்கள் அவர்களுடைய நிதியை நிர்வகிக்க, நிதி பரிமாற்றம், பணம் செலுத்த, மற்றும் வங்கி பொருட்களை விண்ணப்பிக்கலாம். React உடன் கட்டப்பட்ட மற்றும் வேகமான சுமை நேரம் மற்றும் பதிலளிக்கும் வடிவமைப்புக்கு உந்த செய்யப்பட்டது।",
    "image": "/image/Project2.png",
    "techStack": ["React.js", "Redux", "React Hooks", "Axios"],
    "metrics": "15% வேகமான சுமை வேகம்",
    "liveUrl": "https://www.maybank2u.com.my/home/m2u/common/login.do",
    "highlights": [
      "வேகமான சுமைக் நேரம்",
      "பதிலளிக்கும் வடிவமைப்பு",
      "பாதுகாப்பான உறுதிப்படுத்தல்",
      "பல வங்கி பண்புகள்"
    ]
  },
  {
    "title": "வங்கி API ஒருங்கிணைப்பு",
    "description": "காப்பீடு பொருட்களின் ஒருங்கிணைப்புக்கான RESTful API மேம்பாடு, வங்கி பங்குதாரர்களுக்கு மூலம் மென்மையான புதுப்பிப்புகள் மற்றும் ক্রয়களை செயல்படுத்துகிறது।",
    "fullDescription": "ஒரு உறுதிசாலி API அடுக்கு இது வங்கி தளங்களுக்குள் காப்பீடு பொருட்களின் ஒருங்கிணைப்புக்கு செயல்படுகிறது। கொள்கை புதுப்பிப்புகள், புதிய ক்রয়ங்கள், கோரை சமர्पण மற்றும் பல வங்கி பங்குதாரர்களுக்கு உடனான வங்கி சேவை ஒருங்கிணைப்புகளை ஆதரிக்கிறது।",
    "image": "/image/Project3.png",
    "techStack": ["Spring Boot", "RESTful APIs", "Microservices", "Java"],
    "highlights": [
      "மைக்ரோசேவைகள் கட்டமைப்பு",
      "API-முதல் வடிவமைப்பு",
      "உயர் கிடைக்கும்தன்மை",
      "வங்கி பங்குதாரர் ஒருங்கிணைப்பு"
    ],
    "githubUrl": "#"
  },
  {
    "title": "Power BI பகுப்பாய்வு பலகை",
    "description": "விரிவான தரவு காட்சி தீர்வு நடைமுறை வணிக நுண்ணறிவு மற்றும் முடிவெடுப்பதற்கான நிரந்தর நேர பகுப்பாய்வு வழங்குகிறது।",
    "fullDescription": "ஒரு மேம்பட்ட பகுப்பாய்வு பலகை இதுக்கு பல ஆதாரங்களிலிருந்து தரவை ஒருங்கிணைக்கிறது, வணிக மெட்ரிக்கள், வாடிக்கையாளர் போக்குகள், மற்றும் இயக்க செயல்பாட்டில் நிரந்தர நேர நுண்ணறிவை வழங்குகிறது। ஐகான் காட்சிப்பாடுகள் மற்றும் தனிப்பயன் KPI ட்র্যாக்கிங் பண்புகளை உள்ளடக்கியுள்ளது।",
    "image": "/image/Project4.png",
    "techStack": ["Power BI", "Data Visualization", "SQL", "DAX"],
    "highlights": [
      "நிரந்தர நேர பகுப்பாய்வு",
      "தனிப்பயன் KPI கள்",
      "தரவு ஒருங்கிணைப்பு",
      "ஐகான் பலகைகள்"
    ],
    "liveUrl": "#"
  },
  {
    "title": "கடல் எதிர் குழு தளம்",
    "description": "விநியோகிக்கப்பட்ட குழுக்களுக்கான திட்ட நிர்வாகம் மற்றும் ஒத்துழைப்பு தளம் நிரந்தர நேர புதுப்பிப்புகள் மற்றும் செயல்திறன் ট்র்যாக்கிங் கொண்டு।",
    "fullDescription": "ஒரு விரிவான ஒத்துழைப்பு தளம் பல நாடுகள் முழுவதும் விநியோகிக்கப்பட்ட குழுக்களுக்கு வடிவமைக்கப்பட்டுள்ளது। திட்ட நிர்வாகம், நிரந்தர நேர தொடர்பு, கோப்பு பகிர்வு, மற்றும் விநியோகிக்கப்பட்ட குழு ஒத்துழைப்புக்கு செயல்திறன் பகுப்பாய்வு பண்புகளை உள்ளடக்கியுள்ளது।",
    "image": "/image/Project5.png",
    "techStack": ["React", "Node.js", "MongoDB", "WebSocket"],
    "highlights": [
      "நிரந்தர நேர ஒத்துழைப்பு",
      "திட்ட நிர்வாகம்",
      "குழு பகுப்பாய்வு",
      "கோப்பு பகிர்வு"
    ],
    "liveUrl": "#"
  },
  {
    "title": "சைபர் பாதுகாப்பு இணக்கம் கருவி",
    "description": "வங்கி Negara தரங்களுக்கான பாதுகாப்பு பாதகம் மதிப்பீடு மற்றும் இணக்கம் கண்காணிப்பு அமைப்பு।",
    "fullDescription": "ஒரு நிறுவன-தர பாதுகாப்பு கண்காணிப்பு மற்றும் இணக்கம் கருவி இது பாதுகங்களை கண்டறிகிறது, வங்கি ஒழுங்குவிதிகளுடன் இணக்கம் ট்র्যाக் செய்கிறது, மற்றும் தானாக தீர்ப்பு பரிந்துரைகளை வழங்குகிறது। வங்கி Negara மலேசியா பாதுகாப்பு தரங்களுக்கு கூட்ட உறுதி செய்கிறது।",
    "image": "/image/Project6.png",
    "techStack": ["Java", "Spring Security", "PostgreSQL", "Docker"],
    "highlights": [
      "பாதகம் ஸ்கேனிங்",
      "இணக்கம் கண்காணிப்பு",
      "பாதுகாப்பு தன்னியக்கம்",
      "ஒழுங்குவிதி இணக்கம்"
    ],
    "githubUrl": "#"
  }
]
