[
  {
    "title": "Aplicación FWD Insurance React Native",
    "description": "Plataforma de seguros empresarial con módulos DMS, OWB y UnderWrite Me para operaciones simplificadas y experiencia de usuario mejorada.",
    "fullDescription": "Una plataforma de seguros integral construida con React Native, que proporciona a los agentes herramientas digitales para gestionar pólizas de clientes, suscripción y procesamiento de reclamaciones. Las características incluyen sincronización en tiempo real, capacidades sin conexión y compatibilidad multiplataforma.",
    "image": "/image/Project1.png",
    "techStack": ["React Native", "RESTful APIs", "Redux", "TypeScript"],
    "metrics": "Mejora de eficiencia del 15%",
    "liveUrl": "https://www.fwd.com/en/the-fwd-difference/doing-more-with-digital-technology/giving-our-agents-the-digital-tools-they-need/",
    "highlights": [
      "Integración DMS",
      "Funcionalidad en línea/sin conexión",
      "Sincronización de datos en tiempo real",
      "Soporte multiplataforma"
    ]
  },
  {
    "title": "Plataforma de Banca Digital Maybank",
    "description": "Aplicación moderna de una sola página para servicios de banca digital con rendimiento optimizado y experiencia de usuario perfecta.",
    "fullDescription": "Una plataforma de banca digital rica en características que permite a los clientes gestionar sus finanzas, transferir fondos, pagar facturas y solicitar productos bancarios. Construida con React y optimizada para tiempos de carga rápidos y diseño receptivo.",
    "image": "/image/Project2.png",
    "techStack": ["React.js", "Redux", "React Hooks", "Axios"],
    "metrics": "Velocidad de carga 15% más rápida",
    "liveUrl": "https://www.maybank2u.com.my/home/m2u/common/login.do",
    "highlights": [
      "Tiempos de carga rápidos",
      "Diseño receptivo",
      "Autenticación segura",
      "Múltiples características bancarias"
    ]
  },
  {
    "title": "Integración API Bancaria",
    "description": "Desarrollo de API RESTful para integración de productos de seguros, permitiendo renovaciones y compras sin inconvenientes a través de socios bancarios.",
    "fullDescription": "Una capa API robusta que permite la integración de productos de seguros dentro de plataformas bancarias. Admite renovaciones de pólizas, nuevas compras, presentación de reclamaciones e integraciones de servicio al cliente en múltiples socios bancarios.",
    "image": "/image/Project3.png",
    "techStack": ["Spring Boot", "RESTful APIs", "Microservices", "Java"],
    "highlights": [
      "Arquitectura de microservicios",
      "Diseño orientado a API",
      "Alta disponibilidad",
      "Integración de socios bancarios"
    ],
    "githubUrl": "#"
  },
  {
    "title": "Panel de Análisis Power BI",
    "description": "Solución integral de visualización de datos que proporciona información comercial procesable y análisis en tiempo real para la toma de decisiones.",
    "fullDescription": "Un panel de análisis avanzado que consolida datos de múltiples fuentes, proporcionando información en tiempo real sobre métricas comerciales, tendencias de clientes y rendimiento operativo. Incluye visualizaciones interactivas y seguimiento personalizado de KPI.",
    "image": "/image/Project4.png",
    "techStack": ["Power BI", "Data Visualization", "SQL", "DAX"],
    "highlights": [
      "Análisis en tiempo real",
      "KPI personalizados",
      "Consolidación de datos",
      "Paneles interactivos"
    ],
    "liveUrl": "#"
  },
  {
    "title": "Portal de Equipo Transfronterizo",
    "description": "Plataforma de gestión de proyectos y colaboración para equipos distribuidos con actualizaciones en tiempo real y seguimiento del rendimiento.",
    "fullDescription": "Una plataforma de colaboración integral diseñada para equipos distribuidos en múltiples países. Incluye gestión de proyectos, comunicación en tiempo real, uso compartido de archivos y análisis de rendimiento para colaboración de equipos distribuidos.",
    "image": "/image/Project5.png",
    "techStack": ["React", "Node.js", "MongoDB", "WebSocket"],
    "highlights": [
      "Colaboración en tiempo real",
      "Gestión de proyectos",
      "Análisis de equipo",
      "Compartir archivos"
    ],
    "liveUrl": "#"
  },
  {
    "title": "Herramienta de Cumplimiento de Ciberseguridad",
    "description": "Sistema de evaluación de vulnerabilidades de seguridad y monitoreo de cumplimiento para estándares de Bank Negara.",
    "fullDescription": "Una herramienta de monitoreo de seguridad y cumplimiento de nivel empresarial que identifica vulnerabilidades, rastrea el cumplimiento con regulaciones bancarias y proporciona recomendaciones de remediación automatizadas. Garantiza la adherencia a los estándares de seguridad de Bank Negara Malaysia.",
    "image": "/image/Project6.png",
    "techStack": ["Java", "Spring Security", "PostgreSQL", "Docker"],
    "highlights": [
      "Escaneo de vulnerabilidades",
      "Monitoreo de cumplimiento",
      "Automatización de seguridad",
      "Adherencia regulatoria"
    ],
    "githubUrl": "#"
  }
]
