[
  {
    "title": "แอป FWD Insurance React Native",
    "description": "แพลตฟอร์มประกันภัยระดับองค์กรพร้อมโมดูล DMS, OWB และ UnderWrite Me เพื่อปรับปรุงการดำเนินการและประสบการณ์ผู้ใช้ที่ยอดเยี่ยม",
    "fullDescription": "แพลตฟอร์มประกันภัยที่ครอบคลุมสร้างด้วย React Native โดยให้เครื่องมือดิจิทัลแก่ตัวแทนสำหรับการจัดการนโยบายลูกค้า การรับประกันความเสี่ยง และการประมวลผลการเรียกร้อง คุณลักษณะประกอบด้วยการซิงค์แบบเรียลไทม์ ความสามารถในการทำงานแบบออฟไลน์ และความเข้ากันได้ข้ามแพลตฟอร์ม",
    "image": "/image/Project1.png",
    "techStack": ["React Native", "RESTful APIs", "Redux", "TypeScript"],
    "metrics": "ปรับปรุงประสิทธิภาพ 15%",
    "liveUrl": "https://www.fwd.com/en/the-fwd-difference/doing-more-with-digital-technology/giving-our-agents-the-digital-tools-they-need/",
    "highlights": [
      "การรวม DMS",
      "ความสามารถออนไลน์/ออฟไลน์",
      "การซิงค์ข้อมูลแบบเรียลไทม์",
      "การรองรับหลายแพลตฟอร์ม"
    ]
  },
  {
    "title": "แพลตฟอร์มธนาคารดิจิทัล Maybank",
    "description": "แอปพลิเคชันหน้าเดียวสมัยใหม่สำหรับบริการธนาคารดิจิทัลพร้อมประสิทธิภาพที่เหมาะสมและประสบการณ์ผู้ใช้ที่ราบรื่น",
    "fullDescription": "แพลตฟอร์มธนาคารดิจิทัลที่มีฟีเจอร์มากมายซึ่งช่วยให้ลูกค้าสามารถจัดการการเงิน โอนเงิน จ่ายบิล และสมัครสินค้าธนาคาร สร้างด้วย React และเพิ่มประสิทธิภาพเพื่อให้เวลาการโหลดเร็วและการออกแบบที่ตอบสนอง",
    "image": "/image/Project2.png",
    "techStack": ["React.js", "Redux", "React Hooks", "Axios"],
    "metrics": "ความเร็วการโหลดเร็วขึ้น 15%",
    "liveUrl": "https://www.maybank2u.com.my/home/m2u/common/login.do",
    "highlights": [
      "เวลาโหลดเร็ว",
      "การออกแบบที่ตอบสนอง",
      "การยืนยันตัวตนที่ปลอดภัย",
      "ฟีเจอร์ธนาคารหลายรายการ"
    ]
  },
  {
    "title": "การรวม Banking API",
    "description": "การพัฒนา RESTful API สำหรับการรวมสินค้าประกันภัย ซึ่งช่วยให้การต่ออายุและการซื้อที่ราบรื่นผ่านพันธมิตรธนาคาร",
    "fullDescription": "ชั้น API ที่มีประสิทธิภาพซึ่งช่วยให้การรวมสินค้าประกันภัยภายในแพลตฟอร์มธนาคาร รองรับการต่ออายุนโยบาย การซื้อใหม่ การส่งเรียกร้อง และการรวมบริการลูกค้าทั่วพันธมิตรธนาคารหลายแห่ง",
    "image": "/image/Project3.png",
    "techStack": ["Spring Boot", "RESTful APIs", "Microservices", "Java"],
    "highlights": [
      "สถาปัตยกรรมไมโครเซอร์วิส",
      "การออกแบบที่มา API เป็นอันดับแรก",
      "ความพร้อมใช้สูง",
      "การรวมพันธมิตรธนาคาร"
    ],
    "githubUrl": "#"
  },
  {
    "title": "แดชบอร์ด Power BI Analytics",
    "description": "โซลูชันการแสดงผลข้อมูลที่ครอบคลุมเพื่อให้ข้อมูลเชิงลึกทางธุรกิจที่ดำเนินการได้และการวิเคราะห์แบบเรียลไทม์เพื่อการตัดสินใจ",
    "fullDescription": "แดชบอร์ด analytics ขั้นสูงที่รวบรวมข้อมูลจากแหล่งที่มาหลายแห่ง โดยให้ข้อมูลเชิงลึกแบบเรียลไทม์เกี่ยวกับเมตริกทางธุรกิจ แนวโน้มของลูกค้า และประสิทธิภาพการดำเนินการ มีการสร้างภาพและการติดตามตัวชี้วัด KPI ที่เป็นไปตามลำดับ",
    "image": "/image/Project4.png",
    "techStack": ["Power BI", "Data Visualization", "SQL", "DAX"],
    "highlights": [
      "การวิเคราะห์แบบเรียลไทม์",
      "ตัวชี้วัด KPI ที่กำหนดเอง",
      "การรวมข้อมูล",
      "แดชบอร์ดแบบโต้ตอบ"
    ],
    "liveUrl": "#"
  },
  {
    "title": "ศูนย์บริหารองค์กรข้ามแดน",
    "description": "แพลตฟอร์มการจัดการโครงการและทำงานร่วมกันสำหรับทีมที่กระจายอยู่พร้อมการอัปเดตแบบเรียลไทม์และการติดตามประสิทธิภาพ",
    "fullDescription": "แพลตฟอร์มการทำงานร่วมกันที่ครอบคลุมซึ่งออกแบบสำหรับทีมที่กระจายไปทั่วหลายประเทศ มีการจัดการโครงการ การสื่อสารแบบเรียลไทม์ การแบ่งปันไฟล์ และการวิเคราะห์ประสิทธิภาพสำหรับการทำงานร่วมกันของทีมที่กระจาย",
    "image": "/image/Project5.png",
    "techStack": ["React", "Node.js", "MongoDB", "WebSocket"],
    "highlights": [
      "การทำงานร่วมกันแบบเรียลไทม์",
      "การจัดการโครงการ",
      "การวิเคราะห์ทีม",
      "การแบ่งปันไฟล์"
    ],
    "liveUrl": "#"
  },
  {
    "title": "เครื่องมือปฏิบัติตามมาตรฐานความปลอดภัยไซเบอร์",
    "description": "ระบบการประเมินช่องโหว่ความปลอดภัยและการตรวจสอบความสอดคล้องเพื่อปฏิบัติตามมาตรฐาน Bank Negara",
    "fullDescription": "เครื่องมือการตรวจสอบความปลอดภัยและการปฏิบัติตามมาตรฐานระดับองค์กรที่ระบุช่องโหว่ ติดตามการปฏิบัติตามกฎระเบียบด้านธนาคาร และให้คำแนะนำในการแก้ไขที่อัตโนมัติ รับประกันการปฏิบัติตามมาตรฐานความปลอดภัยของ Bank Negara Malaysia",
    "image": "/image/Project6.png",
    "techStack": ["Java", "Spring Security", "PostgreSQL", "Docker"],
    "highlights": [
      "การสแกนช่องโหว่",
      "การตรวจสอบความสอดคล้อง",
      "การทำให้ความปลอดภัยเป็นอัตโนมัติ",
      "การปฏิบัติตามกฎระเบียบ"
    ],
    "githubUrl": "#"
  }
]
