[{"title":"Aplikasi FWD Insurance React Native","description":"Platform insurans perusahaan dengan modul DMS, OWB, dan UnderWrite Me untuk operasi yang dipermudah dan pengalaman pengguna yang ditingkatkan.","fullDescription":"Platform insurans komprehensif yang dibina dengan React Native, memberikan ejen dengan alat digital untuk menguruskan polisi pelanggan, pengunderaitan, dan pemprosesan tuntutan. Ciri-ciri termasuk penyegerakan waktu nyata, kebolehan luar talian, dan keserasian merentas platform.","image":"/image/Project1.png","techStack":["React Native","RESTful APIs","Redux","TypeScript"],"metrics":"Peningkatan kecekapan 15%","liveUrl":"https://www.fwd.com/en/the-fwd-difference/doing-more-with-digital-technology/giving-our-agents-the-digital-tools-they-need/","highlights":["Integrasi DMS","Fungsi Dalam Talian/Luar Talian","Penyegerakan data masa nyata","Sokongan berbilang platform"]},{"title":"Platform Perbankan Digital Maybank","description":"Aplikasi satu halaman moden untuk perkhidmatan perbankan digital dengan prestasi yang dioptimalkan dan pengalaman pengguna yang lancar.","fullDescription":"Platform perbankan digital yang kaya ciri yang membolehkan pelanggan menguruskan kewangan mereka, memindahkan dana, membayar bil, dan memohon produk perbankan. Dibina dengan React dan dioptimalkan untuk waktu pemuatan cepat dan reka bentuk responsif.","image":"/image/Project2.png","techStack":["React.js","Redux","React Hooks","Axios"],"metrics":"Kecepatan pemuatan 15% lebih pantas","liveUrl":"https://www.maybank2u.com.my/home/m2u/common/login.do","highlights":["Waktu pemuatan cepat","Reka bentuk responsif","Pengesahan selamat","Pelbagai ciri perbankan"]},{"title":"Integrasi API Perbankan","description":"Pembangunan API RESTful untuk integrasi produk insurans, memungkinkan pembaruan dan pembelian yang lancar melalui rakan perbankan.","fullDescription":"Lapisan API yang mantap yang memungkinkan integrasi produk insurans dalam platform perbankan. Menyokong pembaruan polisi, pembelian baru, pengajuan tuntutan, dan integrasi perkhidmatan pelanggan di seluruh rakan perbankan.","image":"/image/Project3.png","techStack":["Spring Boot","RESTful APIs","Microservices","Java"],"highlights":["Seni bina microservices","Reka bentuk API-pertama","Ketersediaan tinggi","Integrasi rakan bank"],"githubUrl":"#"},{"title":"Papan Pemuka Analitik Power BI","description":"Penyelesaian visualisasi data yang komprehensif yang memberikan wawasan perniagaan yang boleh ditindakan dan analitik masa nyata untuk pembuatan keputusan.","fullDescription":"Papan pemuka analitik canggih yang menyatukan data dari pelbagai sumber, memberikan pandangan masa nyata tentang metrik perniagaan, aliran pelanggan, dan prestasi operasi. Ciri-ciri visualisasi interaktif dan penjejakan KPI tersuai.","image":"/image/Project4.png","techStack":["Power BI","Data Visualization","SQL","DAX"],"highlights":["Analitik masa nyata","KPI tersuai","Penyatuan data","Papan pemuka interaktif"],"liveUrl":"#"},{"title":"Portal Pasukan Merentas Sempadan","description":"Platform pengurusan projek dan kerjasama untuk pasukan yang tersebar dengan kemas kini masa nyata dan penjejakan prestasi.","fullDescription":"Platform kerjasama yang komprehensif direka untuk pasukan yang tersebar di berbagai negara. Ciri-ciri pengurusan projek, komunikasi masa nyata, perkongsian fail, dan analitik prestasi untuk kerjasama pasukan yang tersebar.","image":"/image/Project5.png","techStack":["React","Node.js","MongoDB","WebSocket"],"highlights":["Kerjasama masa nyata","Pengurusan projek","Analitik pasukan","Perkongsian fail"],"liveUrl":"#"},{"title":"Alat Pematuhan Keamanan Siber","description":"Sistem penilaian kerentanan keamanan dan pemantauan pematuhan untuk piawaian Bank Negara.","fullDescription":"Alat pemantauan keamanan dan pematuhan tingkat perusahaan yang mengenal pasti kerentanan, menjejaki pematuhan dengan peraturan perbankan, dan memberikan cadangan pemulihan automatik. Memastikan pematuhan dengan piawaian keamanan Bank Negara Malaysia.","image":"/image/Project6.png","techStack":["Java","Spring Security","PostgreSQL","Docker"],"highlights":["Pengimbasan kerentanan","Pemantauan pematuhan","Automasi keamanan","Pematuhan peraturan"],"githubUrl":"#"}]
